server/app/controllers/legislators_controller.rb

SELECT  "legislators".* FROM "legislators" WHERE "legislators"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def set_legislator
    @legislator = Legislator.find(params[:id])